from typing import Dict

from collector.ui_def import STANDARD_CHARACTER_HEIGHT, \
    STANDARD_CHARACTER_WIDTH
from extractor.character_extractor import CharacterExtractionParams, extract_characters

character_maps: list[Dict[int, str]] = [
    {
        # 1: "爱丽丝",
        # 2: "红莲-暗影",
        # 3: "灰姑娘",
        4: "海伦",
        # 5: "小红帽",
        # 6: "鲁德米拉-冬日之主",
        # 7: "豺狼",
        # 8: "阿妮斯-闪耀夏日",
        # 9: "皇冠",
        10: "德雷克",
        11: "神罚",
        # 12: "罗珊娜"
    },
    {
        # 1: "拉毗-小红帽",
        # 2: "红莲",
        # 3: "桑迪",
        # 4: "索达-闪亮兔女郎",
        # 5: "娜嘉",
        # 6: "布兰儿",
        6: "小美人鱼",
        # 7: "饼干",
        # 8: "D-杀手妻子",
        # 9: "蒂亚",
        # 10: "桃乐丝",
        # 11: "普丽瓦蒂",
        # 12: "明日香",
    },
    {
        # 1: "麦斯威尔",
        # 2: "明日香-WILLE",
        # 3: "普丽瓦蒂-不友善的女仆",
        # 4: "丽塔",
        # 5: "诺亚尔",
        # 6: "白雪公主",
        # 7: "诺雅",
        7: "米哈拉-羁绊锁链",
        # 8: "梅登-冰玫瑰",
        # 9: "真理",
        # 10: "诺依斯",
        # 11: "长发公主",
        # 12: "布蕾德"
    },
    {
        # 1: "格拉维",
        # 2: "露姬",
        # 3: "安克-天真的女仆",
        4: "零",
        5: "爱蜜莉雅",
        6: "2B",
        7: "零(暂称)",
        # 8: "樱花-夏日绽放",
        9: "蕾姆",
        # 10: "坎西-逃生女王",
        # 11: "爱因",
        # 12: "露菲"
    },
    {
        # e
        # 1: "马斯特-浪漫的女仆",
        # 2: "拖比",
        # 3: "A2",
        # 4: "沃纶姆",
        # 5: "拉普拉斯",
        # 6: "玛律恰那",
        # 7: "马斯特",
        # 8: "米兰达",
        # 9: "安妮-奇迹仙女",
        10: "迪塞尔",
        # 11: "佩珀",
        # 12: "吉萝亭"
    },
    {
        # f
        # 1: "哈兰",
        2: "舒格",
        # 3: "莱昂纳",
        # 4: "鲁玛妮",
        # 5: "梅登",
        # 6: "朵拉",
        # 7: "索达",
        # 8: "罗珊娜-高雅海洋",
        # 9: "玛娜",
        # 10: "牡丹",
        # 11: "富克旺",
        # 12: "海伦-海蓝宝石"
    },
    {
        # g 6
        1: "伊莎贝尔",
        2: "诺薇儿",
        # 3: "贝伊",
        # 4: "白雪公主-纯真年代",
        # 5: "长发公主-纯洁恩典",
        # 6: "阿妮斯",
        # 7: "D",
        # 8: "优尔夏",
        9: "波莉",
        # 10: "樱花",
        # 11: "尼恩-蓝色海洋",
        # 12: "鲁德米拉"
    },
    {
        # h 7
        1: "毒蛇",
        # 2: "艾可希雅",
        # 3: "西格娜",
        # 4: "艾德米",
        # 5: "尼罗",
        # 6: "尤莉亚",
        # 7: "艾菲涅尔",
        # 8: "伊莱格",
        # 9: "潘托姆",
        # 10: "可可",
        # 11: "布丽德",
        # 12: "尼希利斯塔"
    },
    {
        # i 8
        # 1: "克拉乌",
        2: "贝斯蒂",
        3: "特罗尼",
        4: "普琳玛",
        # 5: "尤妮",
        # 6: "基里",
        # 7: "银华",
        # 8: "阿莉亚",
        # 9: "索林",
        # 10: "帕瓦",
        # 11: "梅里-海湾女神",
        12: "吉尔提"
    },
    {
        # j 9
        1: "艾玛",
        # 2: "米哈拉",
        # 3: "米尔克",
        # 4: "爱丽丝-仙境兔女郎",
        # 5: "吉洛",
        # 6: "德尔塔",
        # 7: "玛奇玛",
        # 8: "莱伊",
        # 9: "梅里",
        # 10: "杨",
        # 11: "安克",
        # 12: "艾瑟儿"
    },
    {
        # k 10
        # 1: "露菲-冬日购物狂",
        2: "拉毗",
        # 3: "帕斯卡",
        # 4: "美里",
        # 5: "姬野",
        # 6: "产品12",
        # 7: "拉姆",
        # 8: "茨瓦伊",
        # 9: "森",
        # 10: "N102",
        # 11: "尼恩",
        # 12: "尼夫"
    },
    {
        # l 11
        # 1: "坎西",
        # 2: "士兵Q-W",
        # 3: "士兵F-A",
        # 4: "iDoll花",
        # 5: "贝洛塔",
        # 6: "产品23",
        # 7: "芙罗拉",
        # 8: "产品08",
        9: "爱德",
        # 10: "士兵E-G",
        # 11: "米卡-雪地伙伴",
        # 12: "米卡"
    },
    {
        # m 12
        1: "iDoll太阳",
        2: "iDoll海",
        3: "吉萝婷-寒冬杀手",
        4: "克雷伊",
        5: "樱",
        6: "克劳斯特",
    },
]


def test_character_extractor():
    params = CharacterExtractionParams(
        boundary_width=158,
        character_width=222,
        character_spacing=55,
        height_width_ratio=STANDARD_CHARACTER_HEIGHT / STANDARD_CHARACTER_WIDTH
    )

    image_path = "testdata/samples/c.png"
    output_dir = "testdata/samples/extracted"

    extracted_paths = extract_characters(
        image_path,
        output_dir,
        params,
        character_maps[2]
    )
    print(f"Extracted {len(extracted_paths)} character images")
